# CLI tools
brew "bat"
brew "btop"
brew "composer"
brew "coreutils"
brew "eza"
brew "fd"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "go"
brew "jq"
brew "neovim"
brew "node"
brew "nvm"
brew "php"
brew "pipx"
brew "pnpm"
brew "python@3.12"
brew "ripgrep"
brew "starship"

brew "tree-sitter"

# Terminals & editors
cask "alacritty"
cask "ghostty"
cask "zed"

# Browsers
cask "firefox"
cask "google-chrome"

# Dev tools
cask "insomnia"

# AI tools
cask "claude-code"
# cask "codex"

# Productivity & launchers
cask "rectangle"

# Clipboard & screenshots
cask "flycut"
cask "shottr"

# System utilities
cask "appcleaner"
cask "bitwarden"
cask "karabiner-elements"
cask "mullvad-vpn"
cask "stats"

# Apps
cask "spotify"
cask "whatsapp"

# Fonts
cask "font-d2coding-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
